Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྐར་མདའ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $654 Situated beyond that universe was a universe known as Ulkā .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྐར་མདའ་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ulkāpradīpa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འཕེལ་བ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vardhamānamati.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡེ་ཤེས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $655 Situated beyond that universe was a universe known as Jñānākara .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ གོང་ ན་ མེད་པ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unsurpassable Light Rays .

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ གདུགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $656 Situated beyond that universe was a universe known as Lotus Parasol.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jina.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྔ་སྒྲ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sound of the Drum.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Infinite Eyes.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚངས་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Roar of Brahmā.

source: དེ འི་ ཡང་ འདབ་ [89a] ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $658 Situated beyond that universe [89.a] was a universe known as Direction .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ ཀྱི་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Universal Lamp .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱོགས་ སྣང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Light in the Directions.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སཱ་ལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $659 Situated beyond that universe was a universe known as Sal Tree.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཐུ་བོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jyeṣṭha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེང་གེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Siṃha.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $661 Situated beyond that universe was a universe known as Saṃbhāra.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གྲགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Renown.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ གཟིགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Vipaśyin.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྲིན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Megha.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཀུན་འཛིན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $663 Situated beyond that universe was a universe known as All-Holding.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྨན་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Bhaiṣajyarāja.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དཔལ་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $664 Situated beyond that universe was a universe known as Śrībhadra .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ བཟང་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śrībhadra.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ བཟང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Subhadra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ [89b] ཁམས་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $665 Situated beyond that universe was a universe [89.b] known as Supratiṣṭhita .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མི་ གཡོས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unmoved.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕུག་ སྦས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Guhagupta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $666 Situated beyond that universe was a universe known as Endowed with Incense.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོས་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Gandhaśrī.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $667 Situated beyond that universe was a universe known as Gandhaśrī .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱག་ ན་ སྤོས་ མཆོག་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Incense in Hand.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ པད་མ འི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Padmagarbha.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཙན་དན་ གྱི་ བསུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $668 Situated beyond that universe was a universe known as Sandalwood Fragrance .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ ཁང་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sandalwood Mansion.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔལ་ སྦས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Śrīgupta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ དྲ་བ ས་ ཁེབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $669 Situated beyond that universe was a universe known as Draped with Jewel Nets.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Anantavīrya.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ འཇིགས་བྱེད་ མེ་ཏོག་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Awesome Lotus King of Superior Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དབྱངས་ མཐའ་ ཡ ས་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Boundless Roar.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་པར་ སྣང་བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $671 Situated beyond that universe was a universe known as Vairocana.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ དྲ་བ་ ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Possessor of the Jewel Net.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ [90a] རྒྱལ་ཚབ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched [90.a] his regent, the bodhisattva Śūrdatta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ རབ་གནས་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supra­tiṣṭhita­rāja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བརྗེད་ མེད་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Roar without Forgetfulness.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱག་ ན་ སྤོས་ མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Incense in Hand.

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འབྱོར་པ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vibhūtidatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡིད་ བྲལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $674 Situated beyond that universe was a universe known as Beyond Mind.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ་ ཐམས་ཅད་ ཉེ་བ ར་ སྒྲུབ་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Accomplisher of All Happiness.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕན་ འདོད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Hitakāma.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ སྣ་ཚོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $675 Situated beyond that universe was a universe known as Variegated Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དམིགས་པ་ ཐམས་ཅད་ སྟོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Teacher of All Objects of Perception.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྨོན་ལམ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Aspirations.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣ་ཚོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $676 Situated beyond that universe was a universe known as Diversity.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོངས་ བསྒྲགས་ དོན་ཡོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Meaningful Fame.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གོ་ཆ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Armor.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supratiṣṭhita .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གཙུག་ ན་ ནོར་བུ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Maṇicuḍa.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ བཀོད་པ འི་ དཔལ་ ཞེས་ བྱ་ [90b] བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of the Array of Infinite Qualities. [90.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཐོགས་པ་ མེད་པ འི་ སྙིང་སྟོབས་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of Unimpeded Courage.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $679 Situated beyond that universe was a universe known as Single Lotus Parasol.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ་ བཀོད་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Array of Bliss.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ནམ་མཁ འི་ ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Space Crest.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ནམ་མཁའ་ རྣམ་དག་ སྤྱོད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Pure Space Activity.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་ བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $681 Situated beyond that universe was a universe known as Sukara.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བཟང་པོ་ མཆོག་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of Supreme Excellence.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བཟང་པོ་ དབྱངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Excellent Victor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མར་མེ་ བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $682 Situated beyond that universe was a universe known as Light Maker.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ དྲི་ཞིམ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $683 Situated beyond that universe was a universe known as Fragrant Flower.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ རྣམ་དག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Pure Eye.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྒྱ་མཚོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sāgara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚད་ ཚོགས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $685 Situated beyond that universe was a universe known as Infinite Dimensions and Accumulations. [91.a]

source: [91a] དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendid Noble Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚད་ མེད་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Limitless Intelligence.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ དགའ་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $686 Situated beyond that universe was a universe known as Source of Joy.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕས་ མ་ཕམ་པ འི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Undefeatable Banner.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕས་ མ་ཕམ་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Invincible.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡུལ་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $687 Situated beyond that universe was a universe known as Matter .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངོན་རྟོགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Realization .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Abhaya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ འདས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $688 Situated beyond that universe was a universe known as Beyond Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ མཐའ་ ཡ ས་ མུ་མེད་ སྤོས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Infinite and Endless Incense Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོས་ མཆོག་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendor of Supreme Incense.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲོང་ཁྱེར་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $689 Situated beyond that universe was a universe known as City .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ དཀྱིལ་འཁོར་ རྣམ་དག་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of the Pure Circle of the Moon.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྒྲོན་མ་ འཆང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lamp Holder.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཆོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $690 Situated beyond that universe was a universe known as Supreme .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Mountain.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགའ་བ་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Source of Joy.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྟུལ་བ ས་ བྱིན་ ཅེས་བྱ་བ་ [91b] བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Granted by Gentleness. [91.b]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ རྣམ་དག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Mountain of Purity.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཛེས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $693 Situated beyond that universe was a universe known as Beauty .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཛེས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glory of Beauty.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཛེས་པ་ ཆེན་པོ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Glory of Great Beauty.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་ཞིམ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $694 Situated beyond that universe was a universe known as Fragrant.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཚངས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Brahmā Glory.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དབང་པོ འི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $695 Situated beyond that universe was a universe known as Banner of Indra.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དབང་པོ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Indradatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆོས་ ཀྱི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $696 Situated beyond that universe was a universe known as Dharmadhvaja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Guṇadatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $697 Situated beyond that universe was a universe known as Acintyaśrī .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śrītejā.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ བསགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Accumulated Wisdom.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ ར་ བསམས་པ འི་ སྨོན་ལམ་ ཡོངས་སུ་ གྲུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Fulfilment of Excellent Aspirations.

source: འཚོ་ [92a] ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [92.a]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲོང་ཁྱེར་ བརྒྱན་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $699 Situated beyond that universe was a universe known as King of Adorned Cities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ དག་པ འི་ དཀྱིལ་འཁོར་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of the Pure Sphere.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལྷུན་པོ་ རྣམ་དག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Mountain of Purity.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡེ་ཤེས་ འོད་ ཅེས་ བྱ་བ་ ཡོད་ དེ །_
en: $700 Situated beyond that universe was a universe known as Light of Wisdom.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ སྦས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jñānagupta.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendor of the Source of Wisdom.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཁང་ པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $701 Situated beyond that universe was a universe known as Mansion.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཁང་པ་ སྡེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Mansion Army.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ རྣམ་པར་ སེམས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Wisdom Attention.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡེ་ ཤེས་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $702 Situated beyond that universe was a universe known as Incense of Wisdom.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ བརྩེགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jñānakūṭa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ ཀྱི་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $703 Situated beyond that universe was a universe known as Universal Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱོགས་ སུ་ རྣམ་པར་ གྲགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Universally Renowned.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $704 Situated beyond that universe was a universe known as Stable Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདེ་ བདག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Master of Bliss.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཆོས་ ཀྱི་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Dharmadīpa. [92.b]

source: དེ འི་ ཡང་ [92b] འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲགས་ དགའ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $705 Situated beyond that universe was a universe known as Renowned Joy.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྡུལ་བྲལ་ མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Purity.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་མཇེད་ ཀྱི་ བདག་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lord of Enduring.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $706 Situated beyond that universe was a universe known as King of Superior Lotuses .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior Splendor.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ ཚབ་ དྲི་མ་ མེད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vimala.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ མཐའ་ ཡ ས་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $707 Situated beyond that universe was a universe known as Source of Infinite Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ གྱི་ བསམ་པ་ ཡང་དག་ པར་ སྟོན་པ འི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Leader Who Reveals the Wishes of Beings.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Infinite Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔའ་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Courageous.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སོ་སོ ར་ བག་ཡངས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $709 Situated beyond that universe was a universe known as Carefree.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ རྩེ ར་ འཇུག་ རྩོམ་པ འི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Universal Champion of Exertion.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྟག་ ཏུ་ བརྩམས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of Constant Exertion.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ སོ་སོ ར་ ཡང་དག་ གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $710 Situated beyond that universe was a universe known as Completely Authentic Presence.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ འོད་ཟེར་ པད་མ་ སངས་རྒྱས་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of the Unimpeded Light Rays of the Superior Lotus of Awakening.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ས འི་ ང་རོ་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva King of the Roar of the Grounds.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆུ་ ཀླུང་ གང་ གཱའི་ [93a] བྱེ་མ་ སྙེད་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཀུན་ དང་ ལྡན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $711 Situated beyond that universe, beyond as many universes as there are grains of sand in the river Ganges, was a universe known as [93.a] World Endowed with All Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་ ཐམས་ཅད་ ལ་ སངས་རྒྱས་ ཀྱི་ སྐུ་ ཡང་དག་ པར་ སྟོན་པ འི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Leader Who Displays the Body of the Buddhas to All Māras.

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཀུན་ དུ་ བལྟས་པ འི་ བྱང་ཆུབ་ ཏུ་ ངེས་པ འི་ དགེ་བ འི་ རྩ་བ འི་ སྙིང་སྟོབས་ ཀྱི་ གོ་ཆ་ བགོས་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva great being known as Bearer of the Armor of Courage That Comes from Roots of Virtue Definitively Directed toward All-Seeing Buddhahood would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: That bodhisattva great being had also noticed the great light and heard the sound of the clear voice.

source: ཐོས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before that blessed one, bowed his head to his feet, and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ འདི་ སུ འི་ ལགས །_
en: “Blessed One, whose is this radiance and clear voice?”

source: རིགས་ ཀྱི་ བུ་ ནུབ་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སྟོང་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $712 “Noble son,” |#| “in the west, beyond a thousand innumerable universes, lies a universe known as Enduring.
